import Foundation
//: [День 13](@previous) | [Содержание](Home) | [День 14](@next)
/*:
 # Контрольная точка 8

 ## Протоколы и расширения

 Для данного задания потребуется создать протокол, описывающий Здание. В нём должны быть описаны:

	- Число комнат
	- Стоимость в целочисленном эквиваленте
	- Название компании риелтора
	- Метод для вывода подробной информации о себе

 После этого создать две структуры, реализующие данный протокол: Дом и Офисы
 */



//: [День 13](@previous) | [Содержание](Home) | [День 14](@next)
