import Foundation
//: [День 9](@previous) | [Содержание](Home) | [День 10](@next)
/*:
 # Контрольная точка 5

 ## Замыкания

 В данном задании будет необходимо использовать `filter`, `sorted` и `map` подряд, не используя промежуточные константы для следующего результата:

 1. Отфильтровать все чётные элементы. В результате будет массив из нечётных чисел
 2. Отсортировать числа по возрастанию
 3. Трансформировать каждое число в строку "Число <число> счастливое"
 4. Вывести результат в консоль построчно
  */

let luckyNumbers = [7, 4, 38, 21, 16, 15, 12, 33, 31, 49]

//: [День 9](@previous) | [Содержание](Home) | [День 10](@next)
