import Foundation
//: [День 11](@previous) | [Содержание](Home) | [День 12](@next)
/*:
 # Контрольная точка 6

 ## Структуры

 В данном задании необходимо создать структуру авто. У неё будут следующие свойства:

 1. Название модели
 2. Количество мест в салоне
 3. Текущая передача

 Должен быть хотя бы один метод для смены передачи. Их количество варьируется от 0 по 10

 Стоит обратить внимание на то, какие будут у свойств уровни доступа и изменяемость (константа или переменная)
 */



//: [День 11](@previous) | [Содержание](Home) | [День 12](@next)
