import Foundation
//: [День 12](@previous) | [Содержание](Home) | [День 13](@next)
/*:
 # Контрольная точка 7

 ## Классы

 Создадим иерархию животных.

 1. Во главе всего будет общий класс **Животных** со свойством количества лап
 2. Далее будет наследник **Собака**, у которого будет метод "подать голос"
 3. Создать два наследника **Собаки**: **Корги** и **Пудель**, которые будут по-разному "говорить"
 4. От класса **Животных** создадим нового наследника - **Кота**. У него, как и у **Собаки**, будет метод подать голос, а так же свойство "домашний"
 5. У **Кота** будет два наследника: **Персидский** и **Лев**. Каждый должен по-разному подавать голос
 */



//: [День 12](@previous) | [Содержание](Home) | [День 13](@next)
