import Foundation
//: [День 14](@previous) | [Содержание](Home)
/*:
 # Контрольная точка 9

 ## Опционалы

 В этом задании мы напишем функцию, которая попытается вывести случайное значение из массива. Есть 4 условия:

 1. Массив является опциональным
 2. Если массив отсутствует или пуст, вернуть случайное значение от 1 по 100
 3. Возвращаемым значение должно быть обычное целое число
 4. **Написать всё это в одну строчку**. Не полноценный код, сжатый до одной строчки, а просто одна обычная строка Swift кода
 */



//: [День 14](@previous) | [Содержание](Home)
