import Foundation
//: [День 6](@previous) | [Содержание](Home) | [День 7](@next)
/*:
 # Контрольная точка 3

 ## Контроль потока

 В данном задании будем играть в игру для британских школьников "Fizz Buzz". Смысл заключается в следующем:

 Для чисел от 1 по 100 выводить в консоль один из 4 результатов:

 - Если число делится на 3 без остатка, вывести 'Fizz'
 - Если число делится на 5 без остатка, вывести 'Buzz'
 - Если число делится на 3 *И* на 5 без остатка, вывести 'FizzBuzz'
 - Иначе вывести само число
 */

//: [День 6](@previous) | [Содержание](Home) | [День 7](@next)
