import Foundation
//: [День 8](@previous) | [Содержание](Home) | [День 9](@next)
/*:
 # Контрольная точка 4

 ## Функции

 Написать функцию, которая принимает на вход целое число и возвращает его квадратный корень

 Если кажется, что задание слишком лёгкое - так и есть. Потому несколько ограничений:

 1. Нельзя использовать встроенные функции для решения проблемы, такие как `sqrt()`
 2. Число на входе должно быть целым числом от 1 по 10 000. Если ввести любое другое, тогда выкинуть ошибку "Число не входит в диапазон"
 3. Возвращаемым значением должно быть так же целое число. Если такое не найдено, тогда выкинуть ошибку "Целочисленный корень не найден"
 */



//: [День 8](@previous) | [Содержание](Home) | [День 9](@next)
