/*:
 # Краткое описание курса
 За основу взят курс [100 Дней SwiftUI](https://www.hackingwithswift.com/100/swiftui) Пола Хадсона, который подробно описывает основные аспекты разработки на платформах Apple со специфическим фокусом на iOS разработку

 Однако знания, приобретённые на данном курсе, без труад можно применить и к остальным ОС компании, такие как iPadOS, macOS, watchOS, tvOS и даже visionOS благодаря инструментарию SwiftUI

 В данном файл хранятся первые 14 дней курсе, в которых подробно рассмотрены основы языка Swift, который составляет фундамент SwiftUI

## Содержание
 * Простые данные

	1. [День 1: Первые шаги в Swift](Day1)
	2. [День 2: Простые типы данных](Day2)
	3. [Контрольная точка 1: Простые типы данных](Checkpoint1)

 * Сложные типы данных

	4. [День 3: Сложные типы данных (Часть 1)](Day3)
	5. [День 4: Сложные типы данных (Часть 2)](Day4)
	6. [Контрольная точка 2: Сложные типы данных](Checkpoint2)

 * Контроль потока

	7. [День 5: Условия](Day5)
	8. [День 6: Циклы](Day6)
	9. [Контрольная точка 3: Контроль потока](Checkpoint3)

 * Функции

	10. [День 7: Функции (Часть 1)](Day7)
	11. [День 8: Функции (Часть 2)](Day8)
	12. [Контрольная точка 4: Функции](Checkpoint4)

 * Замыкания (`closure`)

	13. [День 9: Замыкания](Day9)
	14. [Контрольная точка 5: Замыкания](Checkpoint5)

 * Структуры

	15. [День 10: Структуры (Часть 1)](Day10)
	16. [День 11: Структуры (Часть 2)](Day11)
	17. [Контрольная точка 6: Структуры](Checkpoint6)

 * Классы

	18. [День 12: Классы](Day12)
	19. [Контрольная точка 7: Классы](Checkpoint7)

 * Протоколы и расширения

	20. [День 13: Протоколы и расширения](Day13)
	21. [Контрольная точка 8: Протоколы и расширения](Checkpoint8)

 * Опционалы

	22. [День 14: Опционалы](Day14)
	23. [Контрольная точка 9: Опционалы](Checkpoint9)
*/
